from bytes_parser.frame import Frame
from bytes_parser.row import Row


ddi_frame: Frame = Frame('Кадр ДДИИ', [
    Row("Метка начала кадра", 2, 'X'),
    Row("Определитель кадра", 2, 'X'),
    Row("Номер кадра", 2),
    Row("Время кадра, с", 4),
    Row("Длительность измерения", 2),
    Row("ТЗЧ dE > 1 МэВ/(мг/см^2)", 2),
    Row("ТЗЧ dE > 5 МэВ/(мг/см^2)", 2),
    Row("ТЗЧ dE > 10 МэВ/(мг/см^2)", 2),
    Row("ТЗЧ dE > 20 МэВ/(мг/см^2)", 2),
    Row("ТЗЧ dE > 45 МэВ/(мг/см^2)", 2),
    Row("Электроны E > 0.1 МэВ", 4),
    Row("Электроны E > 0.5 МэВ", 4),
    Row("Электроны E > 0.8 МэВ", 4),
    Row("Электроны E > 1.6 МэВ", 4),
    Row("Электроны E > 3 МэВ", 4),
    Row("Электроны E > 5 МэВ", 4),
    Row("Протоны E > 10 МэВ", 2),
    Row("Протоны E > 30 МэВ", 2),
    Row("Протоны E > 60 МэВ", 2),
    Row("Протоны E > 100 МэВ", 2),
    Row("Протоны E > 200 МэВ", 2),
    Row("Протоны E > 500 МэВ", 2),
    Row("Счетчик общего числа событий E > 1.6 МэВ", 4),
    Row("CRC16", 2, 'X')
])